package helper;

import java.util.Arrays;

public class notice_mapping {
    public static void main(String[] args) {
        String a = "PLI700001021\teventCode-2020072400000000002\n" +
                "PLI700001062\teventCode-2020110600000000001\n" +
                "POSC64040596406280\teventCode-2020092200000000001\n" +
                "POSC64041038905345\teventCode-2020071600000000005\n" +
                "POS64041542221827\teventCode-2020092400000000001\n" +
                "POSC64042097967109\teventCode-2020071600000000001\n" +
                "Payment64253646077952\teventCode-2020091400000000005\n" +
                "POSC64812910379008\teventCode-2020092300000000001\n" +
                "POS64813405306882\teventCode-2020071600000000004\n" +
                "CLS66789616648194\teventCode-2020120200000000001\n" +
                "CLS66806236577798\teventCode-2019061400000000002\n" +
                "CLS66813075390466\teventCode-2019121100000121105\n" +
                "CLS66816481165316\teventCode-2019112600000000007\n" +
                "CLS66818339241990\teventCode-2020120200000000001\n" +
                "CLS66819452829704\teventCode-2019121100000121104\n" +
                "CLS66825882697729\teventCode-000000002020022701\n" +
                "CLR66827214389251\teventCode-2020120400000000001\n" +
                "CLR66828390891525\teventCode-2019121100000121102\n" +
                "CLR66829179420679\teventCode-2019112600000000004\n" +
                "CLR66830204928000\t??????????找不到\n" +
                "CLR66831205269506\t??????????找不到\n" +
                "CLR66832918642692\t??????????找不到\n" +
                "Claim66833782669318\teventCode-2020120200000000002\n" +
                "Claim66834984337416\teventCode-2019121100000121103\n" +
                "Claim66835712049153\t??????????找不到\n" +
                "CLS67144955985920\t??????????找不到\n" +
                "CLS67146598055938\teventCode-2019121100000121105\n" +
                "Claim67147527094276\teventCode-2021010600000000001\n" +
                "Claim67149280313350\teventCode-2020121000000000001\n" +
                "Claim67151354396672\teventCode-2020113000000000001\n" +
                "Claim67152983883778\teventCode-2019121100000121101\n" +
                "Claim67154120540164\teventCode-2019112600000000003\n" +
                "Claim67154982469638\teventCode-2020121000000000001\n" +
                "POS67172250419205\teventCode-2021010700000000001\n" +
                "PLI67340202934272\teventCode-2021091811100000001\n" +
                "PLI67340513312770\teventCode-2021091811170000001\n" +
                "POS67874509029378\teventCode-2019121600000000002\n" +
                "Payment74781074391040\teventCode-2021072610463600001\n" +
                "POSC74790339608578\teventCode-2021072610463500001\n" +
                "CLA74907308261380\teventCode-2021090217290000001\n" +
                "Claim75465941319686\teventCode-2021090617570000001\n" +
                "CLS77323793596423\t??????????找不到\n" +
                "CLS77323923619840\t??????????找不到\n" +
                "POS77475004547074\teventCode-2021091811190000001\n" +
                "POS77479823802372\teventCode-2021101111030000001\n" +
                "POS77480572485638\teventCode-2021101411240000001\n" +
                "Payment77487730065416\teventCode-2021102011190000001\n" +
                "POS77505780252673\teventCode-2021110318000000001\n" +
                "UC77518516256771\teventCode-2021081900000000001\n" +
                "Payment78020790452229\teventCode-2021101911190000001\n" +
                "POS78021788696583\teventCode-2021101200000000001\n" +
                "POS78022405259264\teventCode-2021091811180000001\n" +
                "Payment78035187400706\teventCode-2021101918480000001\n" +
                "CLS80208319217665\teventCode-2021090618290000001\n" +
                "CLS80573326426115\t？？？？？？\n" +
                "Claim81070988984326\teventCode-2021090314440000001\n" +
                "CLS81070194163716\teventCode-2021090615010000001\n" +
                "CLR81073732059144\teventCode-2021090616260000001\n" +
                "Claim81074730303490\teventCode-2019121100000121103\n" +
                "CLS81075437043716\teventCode-2021090615390000001\n" +
                "CLR81986314043397\t？？？？？？\n" +
                "Payment82562175205381\teventCode-2020072700000000007\n" +
                "Payment85063949615105\teventCode-2020072700000000007\n" +
                "PLI89042280513537\teventCode-2019121600000000001\n" +
                "PLI89451946573824\teventCode-2022031400000000004\n";
        String[] split = a.split("\n");
        Arrays.asList(split).forEach(x->{
            System.out.println("case when nn.notification_code = "+"'"+x.split("\t")[0] +"'" +" then"+"'"+x.split("\t")[1]+"'" );
        });
    }
}
